In [1]:
import pandas as pd
import numpy as np
# to suppress some annoying messages
import warnings

In [2]:
# Suppress FutureWarnings
# I don't want annoying messages about agg
warnings.simplefilter(action='ignore', category=FutureWarning)

# Read in salary data into a dataframe

In [3]:
df = pd.read_csv('salary.csv', delimiter='\t')

In [4]:
print(df)

      name                        career  yearly_salary gender  age age_group
0     Brad                        doctor         150000      m   35     30–39
1     Sana                 idol / singer        1450000      f   28     20–29
2     Luke                  data analyst          80000      m   39     30–39
3     Tony                       teacher          45000      m   42     40–49
4     Mike                 account clerk          44630      m   25     20–29
5     Leia             chemical engineer         112000      f   45     40–49
6     Nick                           CEO         250000      m   57     50–59
7   Cheryl   software engineering intern          68000      f   23     20–29
8    Wayne                        author          75000      m   75     70–79
9    Julie                        author          80000      f   40     40–49
10    John         pizza delivery driver          30000      m   37     30–39
11    Jean                      waitress          30000      f   27     20–29
12   Sonja                     professor         150000      f   45     40–49
13   Sarah                   Uber driver          40000      f   38     30–39
14    Mary                        lawyer         300000      f   33     30–39
15  Olivia                    day trader          80000      f   65     60–69
16   Pilar  entrepreneur / self-employed          55000      m   47     40–49

# Group by gender

In [5]:
# grouped by gender
gender_group = df.groupby('gender')

## Group by gender for yearly salary
### Calculate mean and median for yearly salary

In [6]:
# group by gender and get mean and median of salary
aggregated_df = gender_group ['yearly_salary'].agg([np.mean, np.median])

In [7]:
print(aggregated_df)

                 mean   median
gender
f       256666.666667  80000.0
m        91203.750000  65000.0

## Get first values from each gender group

In [8]:
# get first values for each column from grouped by gender
first = gender_group.first()

In [9]:
print(first)

        name         career  yearly_salary  age age_group
gender
f       Sana  idol / singer        1450000   28     20–29
m       Brad         doctor         150000   35     30–39